In [1]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name":['harry','piyush','mayank','shubh'],
    "marks":[92,98,90,60],
    "city":['rampur','alwar','gorakhpur','delhi']
}

In [4]:
df=pd.DataFrame(dict1)

In [5]:
df

     name  marks       city
0   harry     92     rampur
1  piyush     98      alwar
2  mayank     90  gorakhpur
3   shubh     60      delhi

In [7]:
df.to_csv('friend.csv')

In [9]:
df.to_csv('friend_index_false.csv', index=False)

In [10]:
df.head(2)

     name  marks    city
0   harry     92  rampur
1  piyush     98   alwar

In [11]:
df.tail(2)

     name  marks       city
2  mayank     90  gorakhpur
3   shubh     60      delhi

In [12]:
df.describe()

           marks
count   4.000000
mean   85.000000
std    17.009801
min    60.000000
25%    82.500000
50%    91.000000
75%    93.500000
max    98.000000

In [21]:
piyush = pd.read_csv('friend.csv')

In [22]:
piyush

   Unnamed: 0    name  marks       city
0           0   harry     92     rampur
1           1  piyush     98      alwar
2           2  mayank     90  gorakhpur
3           3   shubh     60      delhi

In [25]:
piyush['marks'][0]=50

C:\Users\user\AppData\Local\Temp\ipykernel_6292\2862785960.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  piyush['marks'][0]=50

In [26]:
piyush

   Unnamed: 0    name  marks       city
0           0   harry     50     rampur
1           1  piyush     98      alwar
2           2  mayank     90  gorakhpur
3           3   shubh     60      delhi

In [27]:
piyush.index = ['first','second','third','fourth']

In [28]:
piyush

        Unnamed: 0    name  marks       city
first            0   harry     50     rampur
second           1  piyush     98      alwar
third            2  mayank     90  gorakhpur
fourth           3   shubh     60      delhi